Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Define a variable with a string of text.
fr: Définit une variable avec une chaîne de texte.

# Pass the variable to StringSplit and using the delimiter " ".
source: Pass the variable to StringSplit and using the delimiter "\n".
fr: Passe la variable à StringSplit en utilisant le séparateur "\\n".

source: Note that flag parameter is set to $STR_ENTIRESPLIT (1) as it would split at \ or n otherwise.
fr: Notez que le paramètre de flag est défini sur $STR_ENTIRESPLIT (1) comme il couperait à \ ou n ou autrement.

source: Directly access the array index by using array access on expression.
fr: Accéde directement à l'index du tableau à l'aide d'un accès au tableau par une expression.

source: Removes all carriage return values ( Chr(13) ) from a string.
fr: Supprime tous les retours à la ligne ( Chr(13) ) dans une chaîne.

source: Returns the string with all instances of the @CR character ( Chr(13) ) removed.
fr: Retourne la chaîne avec toutes les instances du caractère @CR ( Chr(13) ) supprimées.

source: A string with carriage return characters.
fr: Une chaîne avec des caractères 'retour chariot'.

source: Strip all carriage return characters in the string.
fr: Supprime tous les caractères 'retour chariot' dans la chaîne.

source: Display the before and after string.
fr: Affiche la chaîne avant et après.

source: Strips the white space in a string.
fr: Enlève les 'espaces blancs' dans une chaîne.

source: The string to strip.
fr: La chaîne à traiterer.

source: Flag to indicate the type of stripping that should be performed (add the flags together for multiple operations):
fr: Option pour indiquer le type de nettoyage à effectuer.Peut être une combinaison des éléments suivants :

source: $STR_STRIPLEADING (1) = strip leading white space
fr: $STR_STRIPLEADING (1) = enlève les espaces blanc du début de chaîne

source: $STR_STRIPTRAILING (2) = strip trailing white space
fr: $STR_STRIPTRAILING (2) = enlève les espaces blanc de fin de chaîne

source: $STR_STRIPSPACES (4) = strip double (or more) spaces between words
fr: $STR_STRIPSPACES (4) = enlève les espaces doubles (ou plus) entre les mots

source: $STR_STRIPALL (8) = strip all spaces (over-rides all other flags)
fr: $STR_STRIPALL (8) = enlève tous les espaces (supplante toutes les autres paramètres)

source: Returns the new string stripped of the requested white space.
fr: Retourne la nouvelle chaîne nettoyée des espaces blancs demandés.

source: Whitespace includes Chr(9) thru Chr(13) which are HorizontalTab, LineFeed, VerticalTab, FormFeed, and CarriageReturn.
fr: Les 'espaces blancs' incluent Chr(9) à Chr(13), qui sont HorizontalTab (tabulation horizontale), LineFeed (saut de ligne), VerticalTab (tabulation verticale), FormFeed (saut de page), et CarriageReturn (retour à la ligne).

source: Whitespace also includes the null string ( Chr(0) ) and the standard space ( Chr(32) ).
fr: Les 'espaces blancs' comprennent aussi le caractère nul ( Chr(0) ) et l'espace standard ( Chr(32) ).

source: To strip single spaces between words, use the function StringReplace().
fr: Pour enlever les espaces simples entre les mots, utiliser la fonction StringReplace().

source: Strip leading and trailing whitespace as well as the double spaces (or more) in between the words.
fr: Coupe avant et après les espaces blancs, ainsi que les doubles espaces (ou plus) entre les mots.

source: Converts a string to an array containing the ASCII code of each character.
fr: Convertit une chaîne en un tableau contenant le code ASCII de chaque caractère.

source: The string to convert to an array of ASCII codes.
fr: La chaîne à convertir en tableau de codes ASCII.

source: The 0-based position to start processing from (Default:
fr: La position de base 0 à partir de laquelle le traitement doit commencer ( par défaut :

source: The 0-based position to end processing at (Default:
fr: La position de base 0 à partir de laquelle le traitement doit s'arrêter ( par défaut :

source: StringLen("string")).
fr: StringLen("chaîne")).

source: The returned array will contain values in the specified character set:
fr: Le tableau retourné contiendra les valeurs dans le jeu de caractères spécifié :

source: 0 - UTF-16 (Default)
fr: 0 - UTF-16 ( par défaut )

source: an array where each element is the UNICODE code of the character at the corresponding position.
fr: Retourne un tableau où chaque élément est le code Unicode du caractère à la position correspondante.

source: an empty string.
fr: Retourne une chaîne vide.

source: The string may contain embedded Chr(0).
fr: La chaîne peut embarquer des caractères Chr(0).

source: These will appear in the returned array as well as any data past them.
fr: Ceux-ci apparaissent dans le tableau retourné ainsi que les données passées avec eux.

source: Processing only stops when the end of the string is reached or the user specified end.
fr: Traitement ne s'arrête que lorsque la fin de la chaîne est atteinte ou que l'utilisateur ait spécifié la fin.

source: In order to convert binary data to an array using this function it must first be converted to a string with the BinaryToString() function.
fr: Afin de convertir les données binaires en un tableau en utilisant cette fonction, il doit d'abord être converti en une chaîne avec la fonction BinaryToString().

source: Converts a string into binary data.
fr: Convertit une chaîne en données binaires.

source: An expression to convert into binary data.
fr: Une expression à convertir en données binaires.

source: Changes how the string is stored as binary:
fr: Change la méthode de conversion binaire :

source: 1 = binary data is ANSI (default)
fr: 1 = données binaires ANSI (par défaut)

source: 2 = binary data is UTF16 Little Endian
fr: 2 = données binaires UTF16 Little Endian

source: 3 = binary data is UTF16 Big Endian
fr: 3 = données binaires UTF16 Big Endian

source: 4 = binary data is UTF8
fr: 4 = données binaires UTF8

source: Returns a binary variant.
fr: Retourne une variable de type Variant binaire.

source: Trims a number of characters from the left hand side of a string.
fr: Coupe un nombre de caractères depuis la gauche de la chaîne.

source: The number of characters to trim.
fr: Le nombre de caractères à couper.

source: Returns the string trimmed by count characters from the left.
fr: Retourne la chaîne coupée du nombre count de caractères depuis la gauche.

source: If count is out-of-bounds, an empty string is returned.
fr: Si count est hors-limites, une chaîne vide est retournée.

source: StringTrimLeft($str, $n) is functionally equivalent to StringRight($str, StringLen($str) - $n)
fr: StringTrimLeft($str, $n) est fonctionnellement équivalent à StringRight($str, StringLen($str) - $n)

source: Remove the 5 leftmost characters from the string.
fr: Coupe les 5 caractères les plus à gauche de la chaîne.

source: Trims a number of characters from the right hand side of a string.
fr: Coupe un nombre de caractères depuis la droite de la chaîne.

source: Returns the string trimmed by count characters from the right.
fr: Retourne la chaîne coupée du nombre count de caractères depuis la droite.

source: StringTrimRight($str, $n) is functionally equivalent to StringLeft($str, StringLen($str) - $n)
fr: StringTrimRight($str, $n) est fonctionnellement équivalent à StringLeft($str, StringLen($str) - $n).

source: Remove the 5 rightmost characters from the string.
fr: Coupe les 5 caractères les plus à droite de la chaîne.

source: Converts a string to uppercase.
fr: Convertit une chaîne en majuscules.

source: Returns the string converted to uppercase.
fr: Retourne la chaîne convertie en majuscules.

source: Convert the following string to uppercase.
fr: Convertit la chaîne suivante en majuscules.

source: StructureConstants user defined functions Reference
fr: StructureConstants - Référence

source: When using them you need to add a #include <StructureConstants.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <StructureConstants.au3>.

source: This structure defines the dimensions and color information of a Windows-based device-independent bitmap (DIB)
fr: Cette structure définit les informations de dimensions et de couleur d'une image bitmap indépendante du périphérique Windows (DIB)

source: This structure defines the dimensions information of a Windows-based device-independent bitmap (DIB)
fr: Cette structure définit les informations de dimensions d'une image bitmap indépendante du périphérique Windows (DIB)

source: $tagBLENDFUNCTION structure controls blending by specifying the blending functions for source and destination bitmaps
fr: La structure $tagBLENDFUNCTION contrôle le mélange en précisant les fonctions de mélange pour les images bitmaps source et destination

source: Contains information for the drawing of buttons in a toolbar or rebar
fr: Contient des informations pour le dessin des boutons dans une barre d'outils ou 'rebar'

source: Contains information about an item in a ComboBoxEx control
fr: Contient des informations sur un élément d'un contrôle ComboBoxEx

source: Specifies a range of date and time, in coordinated universal time (UTC)
fr: Indique un intervalle de date et d'heure en coordonnées de temps universel (UTC)

source: Contains information about an event record
fr: Contient des informations sur un enregistrement d'événement

source: Contains the number of 100-nanosecond intervals since January 1, 1601
fr: Contient le nombre d'intervalles de 100 nanosecondes depuis le 1er Janvier, 1601

source: Blur effect parameter structure
fr: Structure du paramètre de l'effet Blur (flou)

source: BrightnessContrast effect parameter structure
fr: Structure du paramètre de l'effet BrightnessContrast (luminosité/contraste)

source: ColorBalance effect parameter structure
fr: Structure du paramètre de l'effet ColorBalance (balance des couleurs)

source: ColorCurve effect parameter structure
fr: Structure du paramètre de l'effet ColorCurve (distorsion des couleurs)

source: ColorLUT effect parameter structure
fr: Structure du paramètre de l'effet ColorLUT (LookUpTable)

source: HueSaturationLightnes effect parameter structure
fr: Structure du paramètre de l'effet HueSaturationLightness (teinte/saturation/luminosité)

source: Levels effect parameter structure
fr: Structure du paramètre de l'effet Levels (brillance)

source: RedEyeCorrection effect parameter structure
fr: Structure du paramètre de l'effet RedEyeCorrection (correction des yeux rouges)

source: Sharpen effect parameter structure
fr: Structure du paramètre de l'effet Sharpen (netteté)

source: Tint effect parameter structure
fr: Structure du paramètre de l'effet Tint (teinte)

source: Bitmap Data
fr: Données de bitmap

source: The ColorMatrix structure contains a 5×5 matrix of real numbers.
fr: La structure ColorMatrix contient une matrice 5x5 de nombres 'float'.

source: Several methods of the ImageAttributes class adjust image colors by using a color matrix
fr: Plusieurs méthodes de la classe ImageAttributes modifient les couleurs d'une image en utilisant une matrice couleur

source: $tagGDIPENCODERPARAM structure
fr: Structure $tagGDIPENCODERPARAM

source: $tagGDIPENCODERPARAMS structure
fr: Structure $tagGDIPENCODERPARAMS

source: $tagGDIPIMAGECODECINFO structure
fr: Structure $tagGDIPIMAGECODECINFO

source: $tagGDIPRECTF structure
fr: Structure $tagGDIPRECTF

source: $tagGDIPSTARTUPINPUT structure
fr: Structure $tagGDIPSTARTUPINPUT

source: $tagGDIPSTARTUPOUTPUT structure
fr: Structure $tagGDIPSTARTUPOUTPUT

source: Contains information for all 4 fields of the IP Address control
fr: Contient des informations pour tous les 4 champs du contrôle de l'adresse IP

source: Represents a globally unique identifier (GUID)
fr: Représente un identifiant globalement unique (GUID)

source: Contains information about an item in a header control
fr: Contient des informations sur un élément d'un contrôle d'en-tête

source: Contains information about an image in an image list
fr: Contient des informations sur une image d'une liste d'images

source: Contains information about a low-level keyboard input event
fr: Contient des informations sur un événement d'entrée de bas niveau du clavier

source: Defines the attributes of a font
fr: Définit les attributs d'une police

source: Contains information used when searching for a list-view item
fr: Contient des informations utilisées lors de la recherche d'un élément de list- view

source: Contains information about a hit test
fr: Contient des informations sur un test de positionnement

source: Specifies or receives the attributes of a list-view item
fr: Indique ou reçoit les attributs d'un élément de list-view

source: Defines the margins of windows that have visual styles applied
fr: Définit les marges d'une fenêtre à laquelle s'appliquent des styles visuels

source: Carries information specific to hit-testing points for a month calendar control
fr: Héberge des informations spécifiques sur le test de positionnement d'un point dans un contrôle de calendrier mensuel

source: Retrieves date information that represents the high and low limits of a month calendar control's display
fr: Récupère les informations de date qui représente les limites haute et basse de l'affichage d'un contrôle de calendrier mensuel

source: Contains information for setting the minimum and maximum allowable dates for a month calendar control
fr: Contient des informations pour fixer les dates minimales et maximales admissibles pour un contrôle de calendrier mensuel

source: Specifies a date and time, in coordinated universal time (UTC)
fr: Indique une date et une heure en temps universel (UTC)

source: Contains information about a menu
fr: Contient des informations sur un menu

source: Contains information about a menu item
fr: Contient des informations sur un élément de menu

source: $tagNETRESOURCE structure
fr: Structure $tagNETRESOURCE

source: Contains information used with the $CBEN_DRAGBEGIN notification message
fr: Contient des informations utilisées par le message de notification $CBEN_DRAGBEGIN

source: Contains information about the conclusion of an edit operation within a ComboBoxEx control
fr: Contient des informations sur la conclusion d'une opération d'édition dans un contrôle ComboBoxEx

source: Contains information specific to ComboBoxEx items for use with notification messages
fr: Contient des informations spécifiques à des éléments d'un ComboBoxEx pour une utilisation avec des messages de notification

source: Contains information about a change that has taken place in a date and time picker (DTP) control
fr: Contient des informations sur un changement qui a eu lieu dans un contrôle Date Time Picker (DTP)

source: Contains information about a portion of the format string that defines a callback field within a date and time picker (DTP) control
fr: Contient des informations sur une partie de la chaîne de mise en forme qui définit un champ de rappel dans un contrôle Date Time Picker (DTP)

source: Contains information about the control callback field
fr: Contient des informations sur le champ de rappel du contrôle

source: Carries information used to describe and handle a $DTN_WMKEYDOWN notification message
fr: Effectue des informations utilisées pour décrire et gérer un message de notification $DTN_WMKEYDOWN

source: Contains information specific to an edit operation that has taken place in the control
fr: Contient des informations spécifiques à une opération d'édition qui a eu lieu dans le contrôle

source: Carries information required to process the $MCN_GETDAYSTATE notification me
fr: Comporte des informations nécessaires au traitement de la notification $MCN_GETDAYSTATE

source: Contains information used in handling $HDN_GETDISPINFO notification messages
fr: Contient des informations utilisées dans le traitement des messages de notification $HDN_GETDISPINFO

source: Specifies or receives the attributes of a filter button click
fr: Indique ou reçoit les attributs d'un clic de bouton filtre

source: Contains information about a notification message
fr: Contient des informations sur un message de notification

source: Contains information about control notification messages
fr: Contient des informations sur les messages de notification de contrôle

source: Contains information for the $IPN_FIELDCHANGED notification message
fr: Contient des informations pour le message de notification $IPN_FIELDCHANGED

source: Sent by a list-view control when the user activates an item
fr: Envoyé par un contrôle list-view lorsque l'utilisateur active un élément

source: Contains information about a list-view notification message
fr: Contient des informations sur un message de notification de list-view

source: Contains information specific to an NM_CUSTOMDRAW (list view) notification message sent by a list-view control
fr: Contient des informations spécifiques sur un message de notification NM_CUSTOMDRAW ( list-view) envoyé par un contrôle list-view

source: Contains information about an $LVN_GETDISPINFO or $LVN_SETDISPINFO notification message
fr: Contient des informations sur un message de notification $LVN_GETDISPINFO ou $LVN_SETDISPINFO

source: Contains information the owner needs to find items requested by a virtual list view control
fr: Contient des informations que le propriétaire a besoin pour trouver des éléments demandés par un contrôle list-view virtuel

source: Contains and receives list-view item information needed to display a ToolTip for an item
fr: Contient et reçoit des informations d'un élément de list-view nécessaires à l'affichage de l'info-bulle d'un élément

source: Contains information used in processing the $LVN_KEYDOWN notification message
fr: Contient des informations utilisées dans le traitement du message de notification $LVN_KEYDOWN

source: Provides information about a scrolling operation
fr: Fournit des informations sur une opération de défilement

source: Contains information used with mouse notification messages
fr: Contient des informations utilisées avec des messages de notification de la souris

source: Contains information used with the $TBN_GETOBJECT, $TCN_GETOBJECT, $RBN_GETOBJECT, and $PSN_GETOBJECT notification messages
fr: Contient des informations utilisées avec les messages de notification $TBN_GETOBJECT, $TCN_GETOBJECT, $RBN_GETOBJECT, et $PSN_GETOBJECT

source: Contains information used in handling the $RBN_AUTOSIZE notification messages
fr: Contient des informations utilisées dans le traitement des messages de notification de $RBN_AUTOSIZE

source: Contains information used in handling various rebar notification messages
fr: Contient des informations utilisées dans le traitement de divers messages de notification d'un contrôle rebar

source: Contains information used with the $RBN_AUTOBREAK notification
fr: Contient des informations utilisées avec la notification $RBN_AUTOBREAK

source: Contains information used in handling the RBN_CHEVRONPUSHED notification message
fr: Contient des informations utilisées dans le traitement du message de notification $RBN_CHEVRONPUSHED

source: Contains information used in handling the RBN_CHILDSIZE notification message
fr: Contient des informations utilisées dans le traitement du message de notification de $RBN_CHILDSIZE

source: Carries information required to process the $MCN_SELCHANGE notification message
fr: Contient des informations nécessaires pour traiter le message de notification $MCN_SELCHANGE

source: Contains information used with the $TBN_HOTITEMCHANGE notification
fr: Contient des informations utilisées avec la notification $TBN_HOTITEMCHANGE

source: Contains information used to process toolbar notification messages
fr: Contient des informations utilisées pour traiter les messages de notification de la barre d'outils

source: Contains information about a tree-view notification message
fr: Contient des informations sur un message de notification de tree-view

source: Contains information specific to an NM_CUSTOMDRAW (tree view) notification message sent by a tree-view control
fr: Contient des informations spécifiques à un message de notification $NM_CUSTOMDRAW envoyé par un contrôle tree-view

source: Contains and receives display information for a tree-view item
fr: Contient et reçoit des informations d'affichage pour un élément d'un contrôle tree-view

source: Contains and receives tree-view item information needed to display a ToolTip for an item
fr: Contient et reçoit des informations, sur un élément de tree-view, nécessaire pour afficher une info-bulle pour un élément

source: Contains information on a treeview item change, sent with $TVN_ITEMCHANGED and $TVN_ITEMCHANGING notifications
fr: Contient des informations sur le changement d'un élément de treeview, envoyées avec les notifications $TVN_ITEMCHANGED et $TVN_ITEMCHANGING

source: Contains information about a keyboard event in a tree-view control
fr: Contient des informations sur un événement clavier dans un contrôle tree-view

source: Contains information information that the GetOpenFileName and GetSaveFileName functions use to initialize an Open or Save As dialog box
fr: Contient des informations que les fonctions GetOpenFileName et GetSaveFileName utilisent pour initialiser une boîte de dialogue Ouvrir ou Enregistrer Sous

source: Contains information used in asynchronous (or overlapped) input and output (I/O)
fr: Contient des informations utilisées dans les entrée/sortie (I/O) asynchrone (ou overlapped)

source: Defines the x- and y- coordinates of a point
fr: Définit les coordonnées X et Y d'un point

source: Contains information about a newly created process and its primary thread
fr: Contient des informations sur un processus nouvellement créé et son thread principal

source: Contains information that defines a band in a rebar control
fr: Contient des informations qui définissent une bande dans un contrôle rebar

source: Defines the coordinates of the upper-left and lower-right corners of a rectangle
fr: Définit les coordonnées des coins supérieur gauche et inférieur droit d'un rectangle

source: Contains scroll bar information
fr: Contient des informations sur un contrôle scroll bar

source: Contains scroll bar parameters to be set by the $SBM_SETSCROLLINFO message, or retrieved by the $SBM_GETSCROLLINFO message
fr: Contient les paramètres de la barre de défilement à définir avec le message $SBM_SETSCROLLINFO, ou à récupérer avec le message $SBM_GETSCROLLINFO

source: Contains the security descriptor for an object and specifies whether the handle retrieved by specifying this structure is inheritable
fr: Contient le descripteur de sécurité pour un objet et indique si le handle récupéré en spécifiant cette structure peut être hérité

source: Stores an ordered pair of integers, typically the width and height of a rectangle
fr: Stocke une paire (ordonnée) de nombres entiers, généralement la largeur et la hauteur d'un rectangle

source: Specifies the window station, desktop, standard handles, and appearance of the main window for a process at creation time
fr: Indique la station window, le bureau, les handles standards, et l'apparence de la fenêtre principale d'un processus lors de sa création

source: Contains information about a button in a toolbar
fr: Contient des informations sur un bouton d'une barre d'outils

source: Contains or receives information for a specific button in a toolbar
fr: Contient ou reçoit des informations relatives à un bouton spécifique d'une barre d'outils

source: Contains basic information about a physical font
fr: Contient des informations de base sur une police physique

source: Specifies information specific to the time zone
fr: Fournit des informations spécifiques sur le fuseau horaire

source: Contains information about a set of privileges for an access token
fr: Contient des informations sur un ensemble de privilèges pour un accès
